MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
/* IPC29 */
#define _U6ERIP IPC29bits.U6ERIP
#define _JTAGIP IPC29bits.JTAGIP
#define _U6ERIP0 IPC29bits.U6ERIP0
#define _U6ERIP1 IPC29bits.U6ERIP1
#define _U6ERIP2 IPC29bits.U6ERIP2
#define _JTAGIP0 IPC29bits.JTAGIP0
#define _JTAGIP1 IPC29bits.JTAGIP1
#define _JTAGIP2 IPC29bits.JTAGIP2

/* INTTREG */
#define _VECNUM INTTREGbits.VECNUM
#define _ILR INTTREGbits.ILR
#define _VHOLD INTTREGbits.VHOLD
#define _CPUIRQ INTTREGbits.CPUIRQ
#define _VECNUM0 INTTREGbits.VECNUM0
#define _VECNUM1 INTTREGbits.VECNUM1
#define _VECNUM2 INTTREGbits.VECNUM2
#define _VECNUM3 INTTREGbits.VECNUM3
#define _VECNUM4 INTTREGbits.VECNUM4
#define _VECNUM5 INTTREGbits.VECNUM5
#define _VECNUM6 INTTREGbits.VECNUM6
#define _VECNUM7 INTTREGbits.VECNUM7
#define _ILR0 INTTREGbits.ILR0
#define _ILR1 INTTREGbits.ILR1
#define _ILR2 INTTREGbits.ILR2
#define _ILR3 INTTREGbits.ILR3

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _SOSCEN OSCCONbits.SOSCEN
#define _POSCEN OSCCONbits.POSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _IOLOCK OSCCONbits.IOLOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* CLKDIV */
#define _PLLEN CLKDIVbits.PLLEN
#define _CPDIV CLKDIVbits.CPDIV
#define _RCDIV CLKDIVbits.RCDIV
#define _DOZEN CLKDIVbits.DOZEN
#define _DOZE CLKDIVbits.DOZE
#define _ROI CLKDIVbits.ROI
#define _CPDIV0 CLKDIVbits.CPDIV0
#define _CPDIV1 CLKDIVbits.CPDIV1
#define _RCDIV0 CLKDIVbits.RCDIV0
#define _RCDIV1 CLKDIVbits.RCDIV1
#define _RCDIV2 CLKDIVbits.RCDIV2
#define _DOZE0 CLKDIVbits.DOZE0
#define _DOZE1 CLKDIVbits.DOZE1
#define _DOZE2 CLKDIVbits.DOZE2

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _STORPOL OSCTUNbits.STORPOL
#define _STOR OSCTUNbits.STOR
#define _STLPOL OSCTUNbits.STLPOL
#define _STLOCK OSCTUNbits.STLOCK
#define _STSRC OSCTUNbits.STSRC
#define _STSIDL OSCTUNbits.STSIDL
#define _STEN OSCTUNbits.STEN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOTUN */
#define _DCOTUN DCOTUNbits.DCOTUN
/* Bitname _TUN0 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN1 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN2 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN3 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN4 cannot be defined because it is used by more than one SFR */
/* Bitname _TUN5 cannot be defined because it is used by more than one SFR */

/* DCOCON */
#define _DCOFSEL DCOCONbits.DCOFSEL
#define _DCOEN DCOCONbits.DCOEN
#define _DCOFSEL0 DCOCONbits.DCOFSEL0
#define _DCOFSEL1 DCOCONbits.DCOFSEL1
#define _DCOFSEL2 DCOCONbits.DCOFSEL2
#define _DCOFSEL3 DCOCONbits.DCOFSEL3

/* OSCDIV */
#define _DIV OSCDIVbits.DIV
#define _DIV0 OSCDIVbits.DIV0
#define _DIV1 OSCDIVbits.DIV1
#define _DIV2 OSCDIVbits.DIV2
#define _DIV3 OSCDIVbits.DIV3
#define _DIV4 OSCDIVbits.DIV4
#define _DIV5 OSCDIVbits.DIV5
#define _DIV6 OSCDIVbits.DIV6
#define _DIV7 OSCDIVbits.DIV7
#define _DIV8 OSCDIVbits.DIV8
#define _DIV9 OSCDIVbits.DIV9
#define _DIV10 OSCDIVbits.DIV10
#define _DIV11 OSCDIVbits.DIV11
#define _DIV12 OSCDIVbits.DIV12
#define _DIV13 OSCDIVbits.DIV13
#define _DIV14 OSCDIVbits.DIV14

/* OSCFDIV */
#define _TRIM OSCFDIVbits.TRIM
#define _TRIM8 OSCFDIVbits.TRIM8
#define _TRIM7 OSCFDIVbits.TRIM7
#define _TRIM6 OSCFDIVbits.TRIM6
#define _TRIM5 OSCFDIVbits.TRIM5
#define _TRIM4 OSCFDIVbits.TRIM4
#define _TRIM3 OSCFDIVbits.TRIM3
#define _TRIM2 OSCFDIVbits.TRIM2
#define _TRIM1 OSCFDIVbits.TRIM1
#define _TRIM0 OSCFDIVbits.TRIM0

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _VREGS RCONbits.VREGS
/* Bitname _CM cannot be defined because it is used by more than one SFR */
#define _RETEN RCONbits.RETEN
#define _SBOREN RCONbits.SBOREN
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR
#define _PMSLP RCONbits.PMSLP

/* HLVDCON */
#define _HLVDL HLVDCONbits.HLVDL
#define _LVDEVT HLVDCONbits.LVDEVT
#define _IRVST HLVDCONbits.IRVST
#define _BGVST HLVDCONbits.BGVST
#define _VDIR HLVDCONbits.VDIR
#define _LSIDL HLVDCONbits.LSIDL
#define _HLVDEN HLVDCONbits.HLVDEN
#define _HLVDL0 HLVDCONbits.HLVDL0
#define _HLVDL1 HLVDCONbits.HLVDL1
#define _HLVDL2 HLVDCONbits.HLVDL2
#define _HLVDL3 HLVDCONbits.HLVDL3

/* PMCON1 */
#define _IRQM PMCON1bits.IRQM
#define _BUSKEEP PMCON1bits.BUSKEEP
#define _ALMODE PMCON1bits.ALMODE
#define _ALP PMCON1bits.ALP
#define _CSF PMCON1bits.CSF
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
#define _ADRMUX PMCON1bits.ADRMUX
#define _PSIDL PMCON1bits.PSIDL
#define _PMPEN PMCON1bits.PMPEN
#define _IRQM0 PMCON1bits.IRQM0
#define _IRQM1 PMCON1bits.IRQM1
#define _CSF0 PMCON1bits.CSF0
#define _CSF1 PMCON1bits.CSF1
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
#define _ADRMUX0 PMCON1bits.ADRMUX0
#define _ADRMUX1 PMCON1bits.ADRMUX1

/* PMCON2 */
#define _RADDR PMCON2bits.RADDR
#define _TIMEOUT PMCON2bits.TIMEOUT
#define _ERROR PMCON2bits.ERROR
#define _BUSY PMCON2bits.BUSY
#define _RADDR16 PMCON2bits.RADDR16
#define _RADDR17 PMCON2bits.RADDR17
#define _RADDR18 PMCON2bits.RADDR18
#define _RADDR19 PMCON2bits.RADDR19
#define _RADDR20 PMCON2bits.RADDR20
#define _RADDR21 PMCON2bits.RADDR21
#define _RADDR22 PMCON2bits.RADDR22
#define _RADDR23 PMCON2bits.RADDR23

