MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
/* DMAINT6 */
/* Bitname _HALFEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRUNIF cannot be defined because it is used by more than one SFR */
/* Bitname _HALFIF cannot be defined because it is used by more than one SFR */
/* Bitname _DONEIF cannot be defined because it is used by more than one SFR */
/* Bitname _LOWIF cannot be defined because it is used by more than one SFR */
/* Bitname _HIGHIF cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DBUFWF cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL5 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL6 cannot be defined because it is used by more than one SFR */

/* DMACH7 */
/* Bitname _CHEN cannot be defined because it is used by more than one SFR */
/* Bitname _SIZE cannot be defined because it is used by more than one SFR */
/* Bitname _TRMODE cannot be defined because it is used by more than one SFR */
/* Bitname _DAMODE cannot be defined because it is used by more than one SFR */
/* Bitname _SAMODE cannot be defined because it is used by more than one SFR */
/* Bitname _CHREQ cannot be defined because it is used by more than one SFR */
/* Bitname _RELOAD cannot be defined because it is used by more than one SFR */
/* Bitname _NULLW cannot be defined because it is used by more than one SFR */
/* Bitname _TRMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _TRMODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _DAMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _DAMODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMODE1 cannot be defined because it is used by more than one SFR */

/* DMAINT7 */
/* Bitname _HALFEN cannot be defined because it is used by more than one SFR */
/* Bitname _OVRUNIF cannot be defined because it is used by more than one SFR */
/* Bitname _HALFIF cannot be defined because it is used by more than one SFR */
/* Bitname _DONEIF cannot be defined because it is used by more than one SFR */
/* Bitname _LOWIF cannot be defined because it is used by more than one SFR */
/* Bitname _HIGHIF cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL cannot be defined because it is used by more than one SFR */
/* Bitname _DBUFWF cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL5 cannot be defined because it is used by more than one SFR */
/* Bitname _CHSEL6 cannot be defined because it is used by more than one SFR */

/* PADCON */
#define _PMPTTL PADCONbits.PMPTTL
#define _IOCON PADCONbits.IOCON

/* IOCSTAT */
#define _IOCPAF IOCSTATbits.IOCPAF
#define _IOCPBF IOCSTATbits.IOCPBF
#define _IOCPCF IOCSTATbits.IOCPCF
#define _IOCPDF IOCSTATbits.IOCPDF
#define _IOCPEF IOCSTATbits.IOCPEF
#define _IOCPFF IOCSTATbits.IOCPFF
#define _IOCPGF IOCSTATbits.IOCPGF

/* TRISA */
#define _TRISA0 TRISAbits.TRISA0
#define _TRISA1 TRISAbits.TRISA1
#define _TRISA2 TRISAbits.TRISA2
#define _TRISA3 TRISAbits.TRISA3
#define _TRISA4 TRISAbits.TRISA4
#define _TRISA5 TRISAbits.TRISA5
#define _TRISA6 TRISAbits.TRISA6
#define _TRISA7 TRISAbits.TRISA7
#define _TRISA9 TRISAbits.TRISA9
#define _TRISA10 TRISAbits.TRISA10
#define _TRISA14 TRISAbits.TRISA14
#define _TRISA15 TRISAbits.TRISA15

/* PORTA */
#define _RA0 PORTAbits.RA0
#define _RA1 PORTAbits.RA1
#define _RA2 PORTAbits.RA2
#define _RA3 PORTAbits.RA3
#define _RA4 PORTAbits.RA4
#define _RA5 PORTAbits.RA5
#define _RA6 PORTAbits.RA6
#define _RA7 PORTAbits.RA7
#define _RA9 PORTAbits.RA9
#define _RA10 PORTAbits.RA10
#define _RA14 PORTAbits.RA14
#define _RA15 PORTAbits.RA15

/* LATA */
#define _LATA0 LATAbits.LATA0
#define _LATA1 LATAbits.LATA1
#define _LATA2 LATAbits.LATA2
#define _LATA3 LATAbits.LATA3
#define _LATA4 LATAbits.LATA4
#define _LATA5 LATAbits.LATA5
#define _LATA6 LATAbits.LATA6
#define _LATA7 LATAbits.LATA7
#define _LATA9 LATAbits.LATA9
#define _LATA10 LATAbits.LATA10
#define _LATA14 LATAbits.LATA14
#define _LATA15 LATAbits.LATA15

/* ODCA */
#define _ODCA0 ODCAbits.ODCA0
#define _ODCA1 ODCAbits.ODCA1
#define _ODCA2 ODCAbits.ODCA2
#define _ODCA3 ODCAbits.ODCA3
#define _ODCA4 ODCAbits.ODCA4
#define _ODCA5 ODCAbits.ODCA5
#define _ODCA6 ODCAbits.ODCA6
#define _ODCA7 ODCAbits.ODCA7
#define _ODCA9 ODCAbits.ODCA9
#define _ODCA10 ODCAbits.ODCA10
#define _ODCA14 ODCAbits.ODCA14
#define _ODCA15 ODCAbits.ODCA15

/* ANSA */
#define _ANSA6 ANSAbits.ANSA6
#define _ANSA7 ANSAbits.ANSA7
#define _ANSA9 ANSAbits.ANSA9
#define _ANSA10 ANSAbits.ANSA10
#define _ANSELA6 ANSAbits.ANSELA6
#define _ANSELA7 ANSAbits.ANSELA7
#define _ANSELA9 ANSAbits.ANSELA9
#define _ANSELA10 ANSAbits.ANSELA10

/* IOCPA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA15 cannot be defined because it is used by more than one SFR */

/* IOCNA */
#define _IOCNA0 IOCNAbits.IOCNA0
#define _IOCNA1 IOCNAbits.IOCNA1
#define _IOCNA2 IOCNAbits.IOCNA2
#define _IOCNA3 IOCNAbits.IOCNA3
#define _IOCNA4 IOCNAbits.IOCNA4
#define _IOCNA5 IOCNAbits.IOCNA5
#define _IOCNA6 IOCNAbits.IOCNA6
#define _IOCNA7 IOCNAbits.IOCNA7
#define _IOCNA9 IOCNAbits.IOCNA9
#define _IOCNA10 IOCNAbits.IOCNA10
#define _IOCNA14 IOCNAbits.IOCNA14
#define _IOCNA15 IOCNAbits.IOCNA15

/* IOCFA */
#define _IOCFA0 IOCFAbits.IOCFA0
#define _IOCFA1 IOCFAbits.IOCFA1
#define _IOCFA2 IOCFAbits.IOCFA2
#define _IOCFA3 IOCFAbits.IOCFA3
#define _IOCFA4 IOCFAbits.IOCFA4
#define _IOCFA5 IOCFAbits.IOCFA5
#define _IOCFA6 IOCFAbits.IOCFA6
#define _IOCFA7 IOCFAbits.IOCFA7
#define _IOCFA9 IOCFAbits.IOCFA9
#define _IOCFA10 IOCFAbits.IOCFA10
#define _IOCFA14 IOCFAbits.IOCFA14
#define _IOCFA15 IOCFAbits.IOCFA15

