MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _SPI3STATH_RXELM1_POSITION               0x00000009
#define _SPI3STATH_RXELM1_MASK                   0x00000200
#define _SPI3STATH_RXELM1_LENGTH                 0x00000001

#define _SPI3STATH_RXELM2_POSITION               0x0000000A
#define _SPI3STATH_RXELM2_MASK                   0x00000400
#define _SPI3STATH_RXELM2_LENGTH                 0x00000001

#define _SPI3STATH_RXELM3_POSITION               0x0000000B
#define _SPI3STATH_RXELM3_MASK                   0x00000800
#define _SPI3STATH_RXELM3_LENGTH                 0x00000001

#define _SPI3STATH_RXELM4_POSITION               0x0000000C
#define _SPI3STATH_RXELM4_MASK                   0x00001000
#define _SPI3STATH_RXELM4_LENGTH                 0x00000001

#define _SPI3STATH_RXELM5_POSITION               0x0000000D
#define _SPI3STATH_RXELM5_MASK                   0x00002000
#define _SPI3STATH_RXELM5_LENGTH                 0x00000001

#define _SPI3BUFL_SPI3BUFL_POSITION              0x00000000
#define _SPI3BUFL_SPI3BUFL_MASK                  0x0000FFFF
#define _SPI3BUFL_SPI3BUFL_LENGTH                0x00000010

#define _SPI3BUFL_DATA_POSITION                  0x00000000
#define _SPI3BUFL_DATA_MASK                      0x0000FFFF
#define _SPI3BUFL_DATA_LENGTH                    0x00000010

#define _SPI3BUFH_SPI3BUFH_POSITION              0x00000000
#define _SPI3BUFH_SPI3BUFH_MASK                  0x0000FFFF
#define _SPI3BUFH_SPI3BUFH_LENGTH                0x00000010

#define _SPI3BUFH_DATA_POSITION                  0x00000000
#define _SPI3BUFH_DATA_MASK                      0x0000FFFF
#define _SPI3BUFH_DATA_LENGTH                    0x00000010

#define _SPI3BRGL_SPI3BRGL_POSITION              0x00000000
#define _SPI3BRGL_SPI3BRGL_MASK                  0x00001FFF
#define _SPI3BRGL_SPI3BRGL_LENGTH                0x0000000D

#define _SPI3BRGL_BRG_POSITION                   0x00000000
#define _SPI3BRGL_BRG_MASK                       0x00001FFF
#define _SPI3BRGL_BRG_LENGTH                     0x0000000D

#define _SPI3IMSK1_SPIRBFEN_POSITION             0x00000000
#define _SPI3IMSK1_SPIRBFEN_MASK                 0x00000001
#define _SPI3IMSK1_SPIRBFEN_LENGTH               0x00000001

#define _SPI3IMSK1_SPITBFEN_POSITION             0x00000001
#define _SPI3IMSK1_SPITBFEN_MASK                 0x00000002
#define _SPI3IMSK1_SPITBFEN_LENGTH               0x00000001

#define _SPI3IMSK1_SPITBEN_POSITION              0x00000003
#define _SPI3IMSK1_SPITBEN_MASK                  0x00000008
#define _SPI3IMSK1_SPITBEN_LENGTH                0x00000001

#define _SPI3IMSK1_SPIRBEN_POSITION              0x00000005
#define _SPI3IMSK1_SPIRBEN_MASK                  0x00000020
#define _SPI3IMSK1_SPIRBEN_LENGTH                0x00000001

#define _SPI3IMSK1_SPIROVEN_POSITION             0x00000006
#define _SPI3IMSK1_SPIROVEN_MASK                 0x00000040
#define _SPI3IMSK1_SPIROVEN_LENGTH               0x00000001

#define _SPI3IMSK1_SRMTEN_POSITION               0x00000007
#define _SPI3IMSK1_SRMTEN_MASK                   0x00000080
#define _SPI3IMSK1_SRMTEN_LENGTH                 0x00000001

#define _SPI3IMSK1_SPITUREN_POSITION             0x00000008
#define _SPI3IMSK1_SPITUREN_MASK                 0x00000100
#define _SPI3IMSK1_SPITUREN_LENGTH               0x00000001

#define _SPI3IMSK1_BUSYEN_POSITION               0x0000000B
#define _SPI3IMSK1_BUSYEN_MASK                   0x00000800
#define _SPI3IMSK1_BUSYEN_LENGTH                 0x00000001

#define _SPI3IMSK1_FRMERREN_POSITION             0x0000000C
#define _SPI3IMSK1_FRMERREN_MASK                 0x00001000
#define _SPI3IMSK1_FRMERREN_LENGTH               0x00000001

#define _SPI3IMSKL_SPIRBFEN_POSITION             0x00000000
#define _SPI3IMSKL_SPIRBFEN_MASK                 0x00000001
#define _SPI3IMSKL_SPIRBFEN_LENGTH               0x00000001

#define _SPI3IMSKL_SPITBFEN_POSITION             0x00000001
#define _SPI3IMSKL_SPITBFEN_MASK                 0x00000002
#define _SPI3IMSKL_SPITBFEN_LENGTH               0x00000001

#define _SPI3IMSKL_SPITBEN_POSITION              0x00000003
#define _SPI3IMSKL_SPITBEN_MASK                  0x00000008
#define _SPI3IMSKL_SPITBEN_LENGTH                0x00000001

#define _SPI3IMSKL_SPIRBEN_POSITION              0x00000005
#define _SPI3IMSKL_SPIRBEN_MASK                  0x00000020
#define _SPI3IMSKL_SPIRBEN_LENGTH                0x00000001

#define _SPI3IMSKL_SPIROVEN_POSITION             0x00000006
#define _SPI3IMSKL_SPIROVEN_MASK                 0x00000040
#define _SPI3IMSKL_SPIROVEN_LENGTH               0x00000001

#define _SPI3IMSKL_SRMTEN_POSITION               0x00000007
#define _SPI3IMSKL_SRMTEN_MASK                   0x00000080
#define _SPI3IMSKL_SRMTEN_LENGTH                 0x00000001

#define _SPI3IMSKL_SPITUREN_POSITION             0x00000008
#define _SPI3IMSKL_SPITUREN_MASK                 0x00000100
#define _SPI3IMSKL_SPITUREN_LENGTH               0x00000001

#define _SPI3IMSKL_BUSYEN_POSITION               0x0000000B
#define _SPI3IMSKL_BUSYEN_MASK                   0x00000800
#define _SPI3IMSKL_BUSYEN_LENGTH                 0x00000001

#define _SPI3IMSKL_FRMERREN_POSITION             0x0000000C
#define _SPI3IMSKL_FRMERREN_MASK                 0x00001000
#define _SPI3IMSKL_FRMERREN_LENGTH               0x00000001

#define _SPI3IMSK2_TXMSK_POSITION                0x00000000
#define _SPI3IMSK2_TXMSK_MASK                    0x0000003F
#define _SPI3IMSK2_TXMSK_LENGTH                  0x00000006

#define _SPI3IMSK2_TXWIEN_POSITION               0x00000007
#define _SPI3IMSK2_TXWIEN_MASK                   0x00000080
#define _SPI3IMSK2_TXWIEN_LENGTH                 0x00000001

#define _SPI3IMSK2_RXMSK_POSITION                0x00000008
#define _SPI3IMSK2_RXMSK_MASK                    0x00003F00
#define _SPI3IMSK2_RXMSK_LENGTH                  0x00000006

#define _SPI3IMSK2_RXWIEN_POSITION               0x0000000F
#define _SPI3IMSK2_RXWIEN_MASK                   0x00008000
#define _SPI3IMSK2_RXWIEN_LENGTH                 0x00000001

#define _SPI3IMSK2_TXMSK0_POSITION               0x00000000
#define _SPI3IMSK2_TXMSK0_MASK                   0x00000001
#define _SPI3IMSK2_TXMSK0_LENGTH                 0x00000001

#define _SPI3IMSK2_TXMSK1_POSITION               0x00000001
#define _SPI3IMSK2_TXMSK1_MASK                   0x00000002
#define _SPI3IMSK2_TXMSK1_LENGTH                 0x00000001

