MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _ANSA_ANSELA7_POSITION                   0x00000007
#define _ANSA_ANSELA7_MASK                       0x00000080
#define _ANSA_ANSELA7_LENGTH                     0x00000001

#define _ANSA_ANSELA9_POSITION                   0x00000009
#define _ANSA_ANSELA9_MASK                       0x00000200
#define _ANSA_ANSELA9_LENGTH                     0x00000001

#define _ANSA_ANSELA10_POSITION                  0x0000000A
#define _ANSA_ANSELA10_MASK                      0x00000400
#define _ANSA_ANSELA10_LENGTH                    0x00000001

#define _ANSELA_ANSA6_POSITION                   0x00000006
#define _ANSELA_ANSA6_MASK                       0x00000040
#define _ANSELA_ANSA6_LENGTH                     0x00000001

#define _ANSELA_ANSA7_POSITION                   0x00000007
#define _ANSELA_ANSA7_MASK                       0x00000080
#define _ANSELA_ANSA7_LENGTH                     0x00000001

#define _ANSELA_ANSA9_POSITION                   0x00000009
#define _ANSELA_ANSA9_MASK                       0x00000200
#define _ANSELA_ANSA9_LENGTH                     0x00000001

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSELA6_POSITION                 0x00000006
#define _ANSELA_ANSELA6_MASK                     0x00000040
#define _ANSELA_ANSELA6_LENGTH                   0x00000001

#define _ANSELA_ANSELA7_POSITION                 0x00000007
#define _ANSELA_ANSELA7_MASK                     0x00000080
#define _ANSELA_ANSELA7_LENGTH                   0x00000001

#define _ANSELA_ANSELA9_POSITION                 0x00000009
#define _ANSELA_ANSELA9_MASK                     0x00000200
#define _ANSELA_ANSELA9_LENGTH                   0x00000001

#define _ANSELA_ANSELA10_POSITION                0x0000000A
#define _ANSELA_ANSELA10_MASK                    0x00000400
#define _ANSELA_ANSELA10_LENGTH                  0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

#define _IOCPA_IOCPA2_POSITION                   0x00000002
#define _IOCPA_IOCPA2_MASK                       0x00000004
#define _IOCPA_IOCPA2_LENGTH                     0x00000001

#define _IOCPA_IOCPA3_POSITION                   0x00000003
#define _IOCPA_IOCPA3_MASK                       0x00000008
#define _IOCPA_IOCPA3_LENGTH                     0x00000001

#define _IOCPA_IOCPA4_POSITION                   0x00000004
#define _IOCPA_IOCPA4_MASK                       0x00000010
#define _IOCPA_IOCPA4_LENGTH                     0x00000001

#define _IOCPA_IOCPA5_POSITION                   0x00000005
#define _IOCPA_IOCPA5_MASK                       0x00000020
#define _IOCPA_IOCPA5_LENGTH                     0x00000001

#define _IOCPA_IOCPA6_POSITION                   0x00000006
#define _IOCPA_IOCPA6_MASK                       0x00000040
#define _IOCPA_IOCPA6_LENGTH                     0x00000001

#define _IOCPA_IOCPA7_POSITION                   0x00000007
#define _IOCPA_IOCPA7_MASK                       0x00000080
#define _IOCPA_IOCPA7_LENGTH                     0x00000001

#define _IOCPA_IOCPA9_POSITION                   0x00000009
#define _IOCPA_IOCPA9_MASK                       0x00000200
#define _IOCPA_IOCPA9_LENGTH                     0x00000001

#define _IOCPA_IOCPA10_POSITION                  0x0000000A
#define _IOCPA_IOCPA10_MASK                      0x00000400
#define _IOCPA_IOCPA10_LENGTH                    0x00000001

#define _IOCPA_IOCPA14_POSITION                  0x0000000E
#define _IOCPA_IOCPA14_MASK                      0x00004000
#define _IOCPA_IOCPA14_LENGTH                    0x00000001

#define _IOCPA_IOCPA15_POSITION                  0x0000000F
#define _IOCPA_IOCPA15_MASK                      0x00008000
#define _IOCPA_IOCPA15_LENGTH                    0x00000001

#define _IOCNA_IOCNA0_POSITION                   0x00000000
#define _IOCNA_IOCNA0_MASK                       0x00000001
#define _IOCNA_IOCNA0_LENGTH                     0x00000001

#define _IOCNA_IOCNA1_POSITION                   0x00000001
#define _IOCNA_IOCNA1_MASK                       0x00000002
#define _IOCNA_IOCNA1_LENGTH                     0x00000001

#define _IOCNA_IOCNA2_POSITION                   0x00000002
#define _IOCNA_IOCNA2_MASK                       0x00000004
#define _IOCNA_IOCNA2_LENGTH                     0x00000001

#define _IOCNA_IOCNA3_POSITION                   0x00000003
#define _IOCNA_IOCNA3_MASK                       0x00000008
#define _IOCNA_IOCNA3_LENGTH                     0x00000001

#define _IOCNA_IOCNA4_POSITION                   0x00000004
#define _IOCNA_IOCNA4_MASK                       0x00000010
#define _IOCNA_IOCNA4_LENGTH                     0x00000001

#define _IOCNA_IOCNA5_POSITION                   0x00000005
#define _IOCNA_IOCNA5_MASK                       0x00000020
#define _IOCNA_IOCNA5_LENGTH                     0x00000001

#define _IOCNA_IOCNA6_POSITION                   0x00000006
#define _IOCNA_IOCNA6_MASK                       0x00000040
#define _IOCNA_IOCNA6_LENGTH                     0x00000001

#define _IOCNA_IOCNA7_POSITION                   0x00000007
#define _IOCNA_IOCNA7_MASK                       0x00000080
#define _IOCNA_IOCNA7_LENGTH                     0x00000001

#define _IOCNA_IOCNA9_POSITION                   0x00000009
#define _IOCNA_IOCNA9_MASK                       0x00000200
#define _IOCNA_IOCNA9_LENGTH                     0x00000001

#define _IOCNA_IOCNA10_POSITION                  0x0000000A
#define _IOCNA_IOCNA10_MASK                      0x00000400
#define _IOCNA_IOCNA10_LENGTH                    0x00000001

#define _IOCNA_IOCNA14_POSITION                  0x0000000E
#define _IOCNA_IOCNA14_MASK                      0x00004000
#define _IOCNA_IOCNA14_LENGTH                    0x00000001

