MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _IOCNA_IOCNA15_POSITION                  0x0000000F
#define _IOCNA_IOCNA15_MASK                      0x00008000
#define _IOCNA_IOCNA15_LENGTH                    0x00000001

#define _IOCFA_IOCFA0_POSITION                   0x00000000
#define _IOCFA_IOCFA0_MASK                       0x00000001
#define _IOCFA_IOCFA0_LENGTH                     0x00000001

#define _IOCFA_IOCFA1_POSITION                   0x00000001
#define _IOCFA_IOCFA1_MASK                       0x00000002
#define _IOCFA_IOCFA1_LENGTH                     0x00000001

#define _IOCFA_IOCFA2_POSITION                   0x00000002
#define _IOCFA_IOCFA2_MASK                       0x00000004
#define _IOCFA_IOCFA2_LENGTH                     0x00000001

#define _IOCFA_IOCFA3_POSITION                   0x00000003
#define _IOCFA_IOCFA3_MASK                       0x00000008
#define _IOCFA_IOCFA3_LENGTH                     0x00000001

#define _IOCFA_IOCFA4_POSITION                   0x00000004
#define _IOCFA_IOCFA4_MASK                       0x00000010
#define _IOCFA_IOCFA4_LENGTH                     0x00000001

#define _IOCFA_IOCFA5_POSITION                   0x00000005
#define _IOCFA_IOCFA5_MASK                       0x00000020
#define _IOCFA_IOCFA5_LENGTH                     0x00000001

#define _IOCFA_IOCFA6_POSITION                   0x00000006
#define _IOCFA_IOCFA6_MASK                       0x00000040
#define _IOCFA_IOCFA6_LENGTH                     0x00000001

#define _IOCFA_IOCFA7_POSITION                   0x00000007
#define _IOCFA_IOCFA7_MASK                       0x00000080
#define _IOCFA_IOCFA7_LENGTH                     0x00000001

#define _IOCFA_IOCFA9_POSITION                   0x00000009
#define _IOCFA_IOCFA9_MASK                       0x00000200
#define _IOCFA_IOCFA9_LENGTH                     0x00000001

#define _IOCFA_IOCFA10_POSITION                  0x0000000A
#define _IOCFA_IOCFA10_MASK                      0x00000400
#define _IOCFA_IOCFA10_LENGTH                    0x00000001

#define _IOCFA_IOCFA14_POSITION                  0x0000000E
#define _IOCFA_IOCFA14_MASK                      0x00004000
#define _IOCFA_IOCFA14_LENGTH                    0x00000001

#define _IOCFA_IOCFA15_POSITION                  0x0000000F
#define _IOCFA_IOCFA15_MASK                      0x00008000
#define _IOCFA_IOCFA15_LENGTH                    0x00000001

#define _CNPUA_IOCPA0_POSITION                   0x00000000
#define _CNPUA_IOCPA0_MASK                       0x00000001
#define _CNPUA_IOCPA0_LENGTH                     0x00000001

#define _CNPUA_IOCPA1_POSITION                   0x00000001
#define _CNPUA_IOCPA1_MASK                       0x00000002
#define _CNPUA_IOCPA1_LENGTH                     0x00000001

#define _CNPUA_IOCPA2_POSITION                   0x00000002
#define _CNPUA_IOCPA2_MASK                       0x00000004
#define _CNPUA_IOCPA2_LENGTH                     0x00000001

#define _CNPUA_IOCPA3_POSITION                   0x00000003
#define _CNPUA_IOCPA3_MASK                       0x00000008
#define _CNPUA_IOCPA3_LENGTH                     0x00000001

#define _CNPUA_IOCPA4_POSITION                   0x00000004
#define _CNPUA_IOCPA4_MASK                       0x00000010
#define _CNPUA_IOCPA4_LENGTH                     0x00000001

#define _CNPUA_IOCPA5_POSITION                   0x00000005
#define _CNPUA_IOCPA5_MASK                       0x00000020
#define _CNPUA_IOCPA5_LENGTH                     0x00000001

#define _CNPUA_IOCPA6_POSITION                   0x00000006
#define _CNPUA_IOCPA6_MASK                       0x00000040
#define _CNPUA_IOCPA6_LENGTH                     0x00000001

#define _CNPUA_IOCPA7_POSITION                   0x00000007
#define _CNPUA_IOCPA7_MASK                       0x00000080
#define _CNPUA_IOCPA7_LENGTH                     0x00000001

#define _CNPUA_IOCPA9_POSITION                   0x00000009
#define _CNPUA_IOCPA9_MASK                       0x00000200
#define _CNPUA_IOCPA9_LENGTH                     0x00000001

#define _CNPUA_IOCPA10_POSITION                  0x0000000A
#define _CNPUA_IOCPA10_MASK                      0x00000400
#define _CNPUA_IOCPA10_LENGTH                    0x00000001

#define _CNPUA_IOCPA14_POSITION                  0x0000000E
#define _CNPUA_IOCPA14_MASK                      0x00004000
#define _CNPUA_IOCPA14_LENGTH                    0x00000001

#define _CNPUA_IOCPA15_POSITION                  0x0000000F
#define _CNPUA_IOCPA15_MASK                      0x00008000
#define _CNPUA_IOCPA15_LENGTH                    0x00000001

#define _CNPUA_IOCPUA0_POSITION                  0x00000000
#define _CNPUA_IOCPUA0_MASK                      0x00000001
#define _CNPUA_IOCPUA0_LENGTH                    0x00000001

#define _CNPUA_IOCPUA1_POSITION                  0x00000001
#define _CNPUA_IOCPUA1_MASK                      0x00000002
#define _CNPUA_IOCPUA1_LENGTH                    0x00000001

#define _CNPUA_IOCPUA2_POSITION                  0x00000002
#define _CNPUA_IOCPUA2_MASK                      0x00000004
#define _CNPUA_IOCPUA2_LENGTH                    0x00000001

#define _CNPUA_IOCPUA3_POSITION                  0x00000003
#define _CNPUA_IOCPUA3_MASK                      0x00000008
#define _CNPUA_IOCPUA3_LENGTH                    0x00000001

#define _CNPUA_IOCPUA4_POSITION                  0x00000004
#define _CNPUA_IOCPUA4_MASK                      0x00000010
#define _CNPUA_IOCPUA4_LENGTH                    0x00000001

#define _CNPUA_IOCPUA5_POSITION                  0x00000005
#define _CNPUA_IOCPUA5_MASK                      0x00000020
#define _CNPUA_IOCPUA5_LENGTH                    0x00000001

#define _CNPUA_IOCPUA6_POSITION                  0x00000006
#define _CNPUA_IOCPUA6_MASK                      0x00000040
#define _CNPUA_IOCPUA6_LENGTH                    0x00000001

#define _CNPUA_IOCPUA7_POSITION                  0x00000007
#define _CNPUA_IOCPUA7_MASK                      0x00000080
#define _CNPUA_IOCPUA7_LENGTH                    0x00000001

#define _CNPUA_IOCPUA9_POSITION                  0x00000009
#define _CNPUA_IOCPUA9_MASK                      0x00000200
#define _CNPUA_IOCPUA9_LENGTH                    0x00000001

#define _CNPUA_IOCPUA10_POSITION                 0x0000000A
#define _CNPUA_IOCPUA10_MASK                     0x00000400
#define _CNPUA_IOCPUA10_LENGTH                   0x00000001

#define _CNPUA_IOCPUA14_POSITION                 0x0000000E
#define _CNPUA_IOCPUA14_MASK                     0x00004000
#define _CNPUA_IOCPUA14_LENGTH                   0x00000001

