MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _CNPDC_CNPDC2_POSITION                   0x00000002
#define _CNPDC_CNPDC2_MASK                       0x00000004
#define _CNPDC_CNPDC2_LENGTH                     0x00000001

#define _CNPDC_CNPDC3_POSITION                   0x00000003
#define _CNPDC_CNPDC3_MASK                       0x00000008
#define _CNPDC_CNPDC3_LENGTH                     0x00000001

#define _CNPDC_CNPDC4_POSITION                   0x00000004
#define _CNPDC_CNPDC4_MASK                       0x00000010
#define _CNPDC_CNPDC4_LENGTH                     0x00000001

#define _CNPDC_CNPDC12_POSITION                  0x0000000C
#define _CNPDC_CNPDC12_MASK                      0x00001000
#define _CNPDC_CNPDC12_LENGTH                    0x00000001

#define _CNPDC_CNPDC13_POSITION                  0x0000000D
#define _CNPDC_CNPDC13_MASK                      0x00002000
#define _CNPDC_CNPDC13_LENGTH                    0x00000001

#define _CNPDC_CNPDC14_POSITION                  0x0000000E
#define _CNPDC_CNPDC14_MASK                      0x00004000
#define _CNPDC_CNPDC14_LENGTH                    0x00000001

#define _CNPDC_CNPDC15_POSITION                  0x0000000F
#define _CNPDC_CNPDC15_MASK                      0x00008000
#define _CNPDC_CNPDC15_LENGTH                    0x00000001

#define _IOCPDC_IOCPDC1_POSITION                 0x00000001
#define _IOCPDC_IOCPDC1_MASK                     0x00000002
#define _IOCPDC_IOCPDC1_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC2_POSITION                 0x00000002
#define _IOCPDC_IOCPDC2_MASK                     0x00000004
#define _IOCPDC_IOCPDC2_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC3_POSITION                 0x00000003
#define _IOCPDC_IOCPDC3_MASK                     0x00000008
#define _IOCPDC_IOCPDC3_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC4_POSITION                 0x00000004
#define _IOCPDC_IOCPDC4_MASK                     0x00000010
#define _IOCPDC_IOCPDC4_LENGTH                   0x00000001

#define _IOCPDC_IOCPDC12_POSITION                0x0000000C
#define _IOCPDC_IOCPDC12_MASK                    0x00001000
#define _IOCPDC_IOCPDC12_LENGTH                  0x00000001

#define _IOCPDC_IOCPDC13_POSITION                0x0000000D
#define _IOCPDC_IOCPDC13_MASK                    0x00002000
#define _IOCPDC_IOCPDC13_LENGTH                  0x00000001

#define _IOCPDC_IOCPDC14_POSITION                0x0000000E
#define _IOCPDC_IOCPDC14_MASK                    0x00004000
#define _IOCPDC_IOCPDC14_LENGTH                  0x00000001

#define _IOCPDC_IOCPDC15_POSITION                0x0000000F
#define _IOCPDC_IOCPDC15_MASK                    0x00008000
#define _IOCPDC_IOCPDC15_LENGTH                  0x00000001

#define _IOCPDC_CNPDC1_POSITION                  0x00000001
#define _IOCPDC_CNPDC1_MASK                      0x00000002
#define _IOCPDC_CNPDC1_LENGTH                    0x00000001

#define _IOCPDC_CNPDC2_POSITION                  0x00000002
#define _IOCPDC_CNPDC2_MASK                      0x00000004
#define _IOCPDC_CNPDC2_LENGTH                    0x00000001

#define _IOCPDC_CNPDC3_POSITION                  0x00000003
#define _IOCPDC_CNPDC3_MASK                      0x00000008
#define _IOCPDC_CNPDC3_LENGTH                    0x00000001

#define _IOCPDC_CNPDC4_POSITION                  0x00000004
#define _IOCPDC_CNPDC4_MASK                      0x00000010
#define _IOCPDC_CNPDC4_LENGTH                    0x00000001

#define _IOCPDC_CNPDC12_POSITION                 0x0000000C
#define _IOCPDC_CNPDC12_MASK                     0x00001000
#define _IOCPDC_CNPDC12_LENGTH                   0x00000001

#define _IOCPDC_CNPDC13_POSITION                 0x0000000D
#define _IOCPDC_CNPDC13_MASK                     0x00002000
#define _IOCPDC_CNPDC13_LENGTH                   0x00000001

#define _IOCPDC_CNPDC14_POSITION                 0x0000000E
#define _IOCPDC_CNPDC14_MASK                     0x00004000
#define _IOCPDC_CNPDC14_LENGTH                   0x00000001

#define _IOCPDC_CNPDC15_POSITION                 0x0000000F
#define _IOCPDC_CNPDC15_MASK                     0x00008000
#define _IOCPDC_CNPDC15_LENGTH                   0x00000001

#define _TRISD_TRISD0_POSITION                   0x00000000
#define _TRISD_TRISD0_MASK                       0x00000001
#define _TRISD_TRISD0_LENGTH                     0x00000001

#define _TRISD_TRISD1_POSITION                   0x00000001
#define _TRISD_TRISD1_MASK                       0x00000002
#define _TRISD_TRISD1_LENGTH                     0x00000001

#define _TRISD_TRISD2_POSITION                   0x00000002
#define _TRISD_TRISD2_MASK                       0x00000004
#define _TRISD_TRISD2_LENGTH                     0x00000001

#define _TRISD_TRISD3_POSITION                   0x00000003
#define _TRISD_TRISD3_MASK                       0x00000008
#define _TRISD_TRISD3_LENGTH                     0x00000001

#define _TRISD_TRISD4_POSITION                   0x00000004
#define _TRISD_TRISD4_MASK                       0x00000010
#define _TRISD_TRISD4_LENGTH                     0x00000001

#define _TRISD_TRISD5_POSITION                   0x00000005
#define _TRISD_TRISD5_MASK                       0x00000020
#define _TRISD_TRISD5_LENGTH                     0x00000001

#define _TRISD_TRISD6_POSITION                   0x00000006
#define _TRISD_TRISD6_MASK                       0x00000040
#define _TRISD_TRISD6_LENGTH                     0x00000001

#define _TRISD_TRISD7_POSITION                   0x00000007
#define _TRISD_TRISD7_MASK                       0x00000080
#define _TRISD_TRISD7_LENGTH                     0x00000001

#define _TRISD_TRISD8_POSITION                   0x00000008
#define _TRISD_TRISD8_MASK                       0x00000100
#define _TRISD_TRISD8_LENGTH                     0x00000001

#define _TRISD_TRISD9_POSITION                   0x00000009
#define _TRISD_TRISD9_MASK                       0x00000200
#define _TRISD_TRISD9_LENGTH                     0x00000001

#define _TRISD_TRISD10_POSITION                  0x0000000A
#define _TRISD_TRISD10_MASK                      0x00000400
#define _TRISD_TRISD10_LENGTH                    0x00000001

#define _TRISD_TRISD11_POSITION                  0x0000000B
#define _TRISD_TRISD11_MASK                      0x00000800
#define _TRISD_TRISD11_LENGTH                    0x00000001

#define _TRISD_TRISD12_POSITION                  0x0000000C
#define _TRISD_TRISD12_MASK                      0x00001000
#define _TRISD_TRISD12_LENGTH                    0x00000001

#define _TRISD_TRISD13_POSITION                  0x0000000D
#define _TRISD_TRISD13_MASK                      0x00002000
#define _TRISD_TRISD13_LENGTH                    0x00000001

