MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _IOCPUG_CNPUG12_POSITION                 0x0000000C
#define _IOCPUG_CNPUG12_MASK                     0x00001000
#define _IOCPUG_CNPUG12_LENGTH                   0x00000001

#define _IOCPUG_CNPUG13_POSITION                 0x0000000D
#define _IOCPUG_CNPUG13_MASK                     0x00002000
#define _IOCPUG_CNPUG13_LENGTH                   0x00000001

#define _IOCPUG_CNPUG14_POSITION                 0x0000000E
#define _IOCPUG_CNPUG14_MASK                     0x00004000
#define _IOCPUG_CNPUG14_LENGTH                   0x00000001

#define _IOCPUG_CNPUG15_POSITION                 0x0000000F
#define _IOCPUG_CNPUG15_MASK                     0x00008000
#define _IOCPUG_CNPUG15_LENGTH                   0x00000001

#define _CNPDG_IOCPDG0_POSITION                  0x00000000
#define _CNPDG_IOCPDG0_MASK                      0x00000001
#define _CNPDG_IOCPDG0_LENGTH                    0x00000001

#define _CNPDG_IOCPDG1_POSITION                  0x00000001
#define _CNPDG_IOCPDG1_MASK                      0x00000002
#define _CNPDG_IOCPDG1_LENGTH                    0x00000001

#define _CNPDG_IOCPDG2_POSITION                  0x00000002
#define _CNPDG_IOCPDG2_MASK                      0x00000004
#define _CNPDG_IOCPDG2_LENGTH                    0x00000001

#define _CNPDG_IOCPDG3_POSITION                  0x00000003
#define _CNPDG_IOCPDG3_MASK                      0x00000008
#define _CNPDG_IOCPDG3_LENGTH                    0x00000001

#define _CNPDG_IOCPDG6_POSITION                  0x00000006
#define _CNPDG_IOCPDG6_MASK                      0x00000040
#define _CNPDG_IOCPDG6_LENGTH                    0x00000001

#define _CNPDG_IOCPDG7_POSITION                  0x00000007
#define _CNPDG_IOCPDG7_MASK                      0x00000080
#define _CNPDG_IOCPDG7_LENGTH                    0x00000001

#define _CNPDG_IOCPDG8_POSITION                  0x00000008
#define _CNPDG_IOCPDG8_MASK                      0x00000100
#define _CNPDG_IOCPDG8_LENGTH                    0x00000001

#define _CNPDG_IOCPDG9_POSITION                  0x00000009
#define _CNPDG_IOCPDG9_MASK                      0x00000200
#define _CNPDG_IOCPDG9_LENGTH                    0x00000001

#define _CNPDG_IOCPDG12_POSITION                 0x0000000C
#define _CNPDG_IOCPDG12_MASK                     0x00001000
#define _CNPDG_IOCPDG12_LENGTH                   0x00000001

#define _CNPDG_IOCPDG13_POSITION                 0x0000000D
#define _CNPDG_IOCPDG13_MASK                     0x00002000
#define _CNPDG_IOCPDG13_LENGTH                   0x00000001

#define _CNPDG_IOCPDG14_POSITION                 0x0000000E
#define _CNPDG_IOCPDG14_MASK                     0x00004000
#define _CNPDG_IOCPDG14_LENGTH                   0x00000001

#define _CNPDG_IOCPDG15_POSITION                 0x0000000F
#define _CNPDG_IOCPDG15_MASK                     0x00008000
#define _CNPDG_IOCPDG15_LENGTH                   0x00000001

#define _CNPDG_CNPDG0_POSITION                   0x00000000
#define _CNPDG_CNPDG0_MASK                       0x00000001
#define _CNPDG_CNPDG0_LENGTH                     0x00000001

#define _CNPDG_CNPDG1_POSITION                   0x00000001
#define _CNPDG_CNPDG1_MASK                       0x00000002
#define _CNPDG_CNPDG1_LENGTH                     0x00000001

#define _CNPDG_CNPDG2_POSITION                   0x00000002
#define _CNPDG_CNPDG2_MASK                       0x00000004
#define _CNPDG_CNPDG2_LENGTH                     0x00000001

#define _CNPDG_CNPDG3_POSITION                   0x00000003
#define _CNPDG_CNPDG3_MASK                       0x00000008
#define _CNPDG_CNPDG3_LENGTH                     0x00000001

#define _CNPDG_CNPDG6_POSITION                   0x00000006
#define _CNPDG_CNPDG6_MASK                       0x00000040
#define _CNPDG_CNPDG6_LENGTH                     0x00000001

#define _CNPDG_CNPDG7_POSITION                   0x00000007
#define _CNPDG_CNPDG7_MASK                       0x00000080
#define _CNPDG_CNPDG7_LENGTH                     0x00000001

#define _CNPDG_CNPDG8_POSITION                   0x00000008
#define _CNPDG_CNPDG8_MASK                       0x00000100
#define _CNPDG_CNPDG8_LENGTH                     0x00000001

#define _CNPDG_CNPDG9_POSITION                   0x00000009
#define _CNPDG_CNPDG9_MASK                       0x00000200
#define _CNPDG_CNPDG9_LENGTH                     0x00000001

#define _CNPDG_CNPDG12_POSITION                  0x0000000C
#define _CNPDG_CNPDG12_MASK                      0x00001000
#define _CNPDG_CNPDG12_LENGTH                    0x00000001

#define _CNPDG_CNPDG13_POSITION                  0x0000000D
#define _CNPDG_CNPDG13_MASK                      0x00002000
#define _CNPDG_CNPDG13_LENGTH                    0x00000001

#define _CNPDG_CNPDG14_POSITION                  0x0000000E
#define _CNPDG_CNPDG14_MASK                      0x00004000
#define _CNPDG_CNPDG14_LENGTH                    0x00000001

#define _CNPDG_CNPDG15_POSITION                  0x0000000F
#define _CNPDG_CNPDG15_MASK                      0x00008000
#define _CNPDG_CNPDG15_LENGTH                    0x00000001

#define _IOCPDG_IOCPDG0_POSITION                 0x00000000
#define _IOCPDG_IOCPDG0_MASK                     0x00000001
#define _IOCPDG_IOCPDG0_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG1_POSITION                 0x00000001
#define _IOCPDG_IOCPDG1_MASK                     0x00000002
#define _IOCPDG_IOCPDG1_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG2_POSITION                 0x00000002
#define _IOCPDG_IOCPDG2_MASK                     0x00000004
#define _IOCPDG_IOCPDG2_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG3_POSITION                 0x00000003
#define _IOCPDG_IOCPDG3_MASK                     0x00000008
#define _IOCPDG_IOCPDG3_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG6_POSITION                 0x00000006
#define _IOCPDG_IOCPDG6_MASK                     0x00000040
#define _IOCPDG_IOCPDG6_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG7_POSITION                 0x00000007
#define _IOCPDG_IOCPDG7_MASK                     0x00000080
#define _IOCPDG_IOCPDG7_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG8_POSITION                 0x00000008
#define _IOCPDG_IOCPDG8_MASK                     0x00000100
#define _IOCPDG_IOCPDG8_LENGTH                   0x00000001

#define _IOCPDG_IOCPDG9_POSITION                 0x00000009
#define _IOCPDG_IOCPDG9_MASK                     0x00000200
#define _IOCPDG_IOCPDG9_LENGTH                   0x00000001

