MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA610/mcu.h
#define _RPINR1_INT3R_POSITION                   0x00000008
#define _RPINR1_INT3R_MASK                       0x00003F00
#define _RPINR1_INT3R_LENGTH                     0x00000006

#define _RPINR2_INT4R_POSITION                   0x00000000
#define _RPINR2_INT4R_MASK                       0x0000003F
#define _RPINR2_INT4R_LENGTH                     0x00000006

#define _RPINR2_OCTRIG2R_POSITION                0x00000008
#define _RPINR2_OCTRIG2R_MASK                    0x00003F00
#define _RPINR2_OCTRIG2R_LENGTH                  0x00000006

#define _RPINR3_T2CKR_POSITION                   0x00000000
#define _RPINR3_T2CKR_MASK                       0x0000003F
#define _RPINR3_T2CKR_LENGTH                     0x00000006

#define _RPINR3_T3CKR_POSITION                   0x00000008
#define _RPINR3_T3CKR_MASK                       0x00003F00
#define _RPINR3_T3CKR_LENGTH                     0x00000006

#define _RPINR4_T4CKR_POSITION                   0x00000000
#define _RPINR4_T4CKR_MASK                       0x0000003F
#define _RPINR4_T4CKR_LENGTH                     0x00000006

#define _RPINR4_T5CKR_POSITION                   0x00000008
#define _RPINR4_T5CKR_MASK                       0x00003F00
#define _RPINR4_T5CKR_LENGTH                     0x00000006

#define _RPINR7_IC1R_POSITION                    0x00000000
#define _RPINR7_IC1R_MASK                        0x0000003F
#define _RPINR7_IC1R_LENGTH                      0x00000006

#define _RPINR7_IC2R_POSITION                    0x00000008
#define _RPINR7_IC2R_MASK                        0x00003F00
#define _RPINR7_IC2R_LENGTH                      0x00000006

#define _RPINR8_IC3R_POSITION                    0x00000000
#define _RPINR8_IC3R_MASK                        0x0000003F
#define _RPINR8_IC3R_LENGTH                      0x00000006

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x0000003F
#define _RPINR11_OCFAR_LENGTH                    0x00000006

#define _RPINR11_OCFBR_POSITION                  0x00000008
#define _RPINR11_OCFBR_MASK                      0x00003F00
#define _RPINR11_OCFBR_LENGTH                    0x00000006

#define _RPINR12_TCKIAR_POSITION                 0x00000000
#define _RPINR12_TCKIAR_MASK                     0x0000003F
#define _RPINR12_TCKIAR_LENGTH                   0x00000006

#define _RPINR12_TCKIBR_POSITION                 0x00000008
#define _RPINR12_TCKIBR_MASK                     0x00003F00
#define _RPINR12_TCKIBR_LENGTH                   0x00000006

#define _RPINR17_U3RXR_POSITION                  0x00000008
#define _RPINR17_U3RXR_MASK                      0x00003F00
#define _RPINR17_U3RXR_LENGTH                    0x00000006

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x0000003F
#define _RPINR18_U1RXR_LENGTH                    0x00000006

#define _RPINR18_U1CTSR_POSITION                 0x00000008
#define _RPINR18_U1CTSR_MASK                     0x00003F00
#define _RPINR18_U1CTSR_LENGTH                   0x00000006

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x0000003F
#define _RPINR19_U2RXR_LENGTH                    0x00000006

#define _RPINR19_U2CTSR_POSITION                 0x00000008
#define _RPINR19_U2CTSR_MASK                     0x00003F00
#define _RPINR19_U2CTSR_LENGTH                   0x00000006

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x0000003F
#define _RPINR20_SDI1R_LENGTH                    0x00000006

#define _RPINR20_SCK1R_POSITION                  0x00000008
#define _RPINR20_SCK1R_MASK                      0x00003F00
#define _RPINR20_SCK1R_LENGTH                    0x00000006

#define _RPINR21_SS1R_POSITION                   0x00000000
#define _RPINR21_SS1R_MASK                       0x0000003F
#define _RPINR21_SS1R_LENGTH                     0x00000006

#define _RPINR21_U3CTSR_POSITION                 0x00000008
#define _RPINR21_U3CTSR_MASK                     0x00003F00
#define _RPINR21_U3CTSR_LENGTH                   0x00000006

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x0000003F
#define _RPINR22_SDI2R_LENGTH                    0x00000006

#define _RPINR22_SCK2R_POSITION                  0x00000008
#define _RPINR22_SCK2R_MASK                      0x00003F00
#define _RPINR22_SCK2R_LENGTH                    0x00000006

#define _RPINR23_SS2R_POSITION                   0x00000000
#define _RPINR23_SS2R_MASK                       0x0000003F
#define _RPINR23_SS2R_LENGTH                     0x00000006

#define _RPINR23_TXCKR_POSITION                  0x00000008
#define _RPINR23_TXCKR_MASK                      0x00003F00
#define _RPINR23_TXCKR_LENGTH                    0x00000006

#define _RPINR25_CLCINAR_POSITION                0x00000000
#define _RPINR25_CLCINAR_MASK                    0x0000003F
#define _RPINR25_CLCINAR_LENGTH                  0x00000006

#define _RPINR25_CLCINBR_POSITION                0x00000008
#define _RPINR25_CLCINBR_MASK                    0x00003F00
#define _RPINR25_CLCINBR_LENGTH                  0x00000006

#define _RPINR27_U4RXR_POSITION                  0x00000000
#define _RPINR27_U4RXR_MASK                      0x0000003F
#define _RPINR27_U4RXR_LENGTH                    0x00000006

#define _RPINR27_U4CTSR_POSITION                 0x00000008
#define _RPINR27_U4CTSR_MASK                     0x00003F00
#define _RPINR27_U4CTSR_LENGTH                   0x00000006

#define _RPINR28_SDI3R_POSITION                  0x00000000
#define _RPINR28_SDI3R_MASK                      0x0000003F
#define _RPINR28_SDI3R_LENGTH                    0x00000006

#define _RPINR28_SCK3R_POSITION                  0x00000008
#define _RPINR28_SCK3R_MASK                      0x00003F00
#define _RPINR28_SCK3R_LENGTH                    0x00000006

#define _RPINR29_SS3R_POSITION                   0x00000000
#define _RPINR29_SS3R_MASK                       0x0000003F
#define _RPINR29_SS3R_LENGTH                     0x00000006

#define _RPOR0_RP0R_POSITION                     0x00000000
#define _RPOR0_RP0R_MASK                         0x0000007F
#define _RPOR0_RP0R_LENGTH                       0x00000007

#define _RPOR0_RP1R_POSITION                     0x00000008
#define _RPOR0_RP1R_MASK                         0x00007F00
#define _RPOR0_RP1R_LENGTH                       0x00000007

